/* มอนตี้ทำสองโปรแกรมแรกเสร็จแล้วก็ได้รับ requirement เพิ่ม คือ ให้เขียนโปรแกรมคำนวณเกรดนักเรียน 
โดยมีเกณฑ์ดังนี้
คะแนน 90 ขึ้นไปจะได้เกรด A+
คะแนน 80 ขึ้นไปจะได้เกรด A
คะแนน 70 ขึ้นไปจะได้เกรด B
คะแนน 60 ขึ้นไปจะได้เกรด C
คะแนน 50 ขึ้นไปจะได้เกรด D
คะแนนต่ำกว่า 50 จะได้เกรด F

เมื่อโปรแกรมทำงานจะแสดงข้อความว่า 'คุณได้คะแนนสอบ 72 คะแนน ดังนั้นคุณได้เกรด B'
*/

let score = 72;
let grade;
// ให้เขียน code ต่อเพื่อให้โปรแกรมทำงานได้ครบถ้วนตาม requirement

if (score >= 90) {
  return (grade = "A+");
} else if (score >= 80) {
  return (grade = "A");
} else if (score >= 70) {
  return (grade = "B");
} else if (score >= 60) {
  return (grade = "C");
} else if (score >= 50) {
  return (grade = "D");
} else if (score < 50) {
  return (grade = "F");
}

console.log(`คุณได้คะแนนสอบ ${score} คะแนน ดังนั้นคุณได้เกรด ${grade} `);
