/* ต่อมามอนตี้ได้รับมอบหมายให้เขียนโปรแกรมตรวจสอบสิทธิ์เลือกตั้ง
โดยมีเกณฑ์ดังนี้
1. บุคคลนั้นต้องมีสัญชาติไทย
2. บุคคลนั้นต้องอายุ 18 ปีขึ้นไป
และต้องเข้าเกณฑ์ทั้งสองข้อจึงจะสามารถเลือกตั้งในประเทศไทยได้

จากข้อมูลของ Shane ที่ด้านล่าง เมื่อกรอกเข้ามาในระบบ จะต้องแสดงข้อความ 'Shane ไม่มีสิทธิ์เลือกตั้งในประเทศไทย'
ให้ใช้ concept เรื่อง String Template Literal ในการแสดงข้อความ 'Shane ไม่มีสิทธิ์เลือกตั้งในประเทศไทย'

กรณีที่เข้าเงื่อนไขทั้งสองข้อ ให้แสดงข้อความ 'ชื่อ มีสิทธิ์เลือกตั้งในประเทศไทย'
*/

let name = "Shane";
let nationality = "Taiwan";
let age = "20";

if (nationality === "Thailand" && age >= 18) {
  console.log(`${name} มีสิทธิเลือกตั้งในประเทศไทย`);
} else {
  console.log(`${name} ไม่มีสิทธิเลือกตั้งในประเทศไทย`);
}
