/*  มอนตี้ไปซื้อของ เมื่อเข้าไปในร้านเขาเห็นข้อความ 'Hi, welcome to our shop!!' เป็นอย่างแรก
    เมื่อหยิบของเสร็จและไปจ่ายเงิน มอนตี้เห็นยอดชำระครั้งแรกเป็น 17025 บาท
    แต่มอนตี้เอ๊ะใจจึงท้วงพนักงาน ทำให้พนักงานแก้ไขยอดให้ จนเป็นยอดที่สมเหตุสมผลคือ 195 บาท
    
    ต่อมาผู้จัดการออกมาขอโทษมอนตี้ และพบว่ายอดยังผิดอยู่ เนื่องจากขนมปังลดราคาเหลือเพียง 45 บาท 
    ให้แก้ไขโปรแกรมเพื่อให้แสดงผลลัพธ์ได้ถูกต้อง โดยมอนตี้จะต้องเห็นข้อความ
    'Hi, welcome to our shop!!'
    ตามด้วย คุณต้องชำระเงิน 170 บาท
*/

let greetingMessage = 'Hi, welcome to our shop!!';

let milk = 100;
const bread = 70;
const candy = "25";

let totalPrice = milk + bread + candy;

console.log(`คุณต้องชำระเงิน ${totalPrice} บาท`);
console.log(greetingMessage);